zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_SIM.h
#endif /* SIM_INTERNAL_PERI_INDEX_T_ */

#if !defined(SIM_INTERNAL_PERI_INPUT_T_)
#define SIM_INTERNAL_PERI_INPUT_T_
typedef enum _sim_internal_peri_input
{
    kSIM_SCI0_RXDsource_GPIOC3_GPIOC8_GPIOF8 = 0U, /**< Select SCI0_RXD source, GPIOC3 or GPIOC8 or GPIOF8. */
    kSIM_SCI0_RXDsource_XB_OUT38    = 1U,          /**< Select SCI0_RXD source, XB_OUT38. */
    kSIM_SCI1_RXDInput_GPIOC12_GPIOF5 = 0U,        /**< Select SCI1_RXD Input, GPIOC12 or GPIOF5. */
    kSIM_SCI1_RXDInput_XB_OUT39     = 1U,          /**< Select SCI1_RXD Input, XB_OUT39. */
    kSIM_TMRA0Input_GPIOC3          = 0U,          /**< Select TMRA0 Input, GPIOC3. */
    kSIM_TMRA0Input_XB_OUT34        = 1U,          /**< Select TMRA0 Input, XB_OUT34. */
    kSIM_TMRA1Input_GPIOC4          = 0U,          /**< Select TMRA1 Input, GPIOC4. */
    kSIM_TMRA1Input_XB_OUT35        = 1U,          /**< Select TMRA1 Input, XB_OUT35. */
    kSIM_TMRA2Input_GPIOC6          = 0U,          /**< Select TMRA2 Input, GPIOC6. */
    kSIM_TMRA2Input_XB_OUT36        = 1U,          /**< Select TMRA2 Input, XB_OUT36. */
    kSIM_TMRA3Input_GPIOC13         = 0U,          /**< Select TMRA3 Input, GPIOC13. */
    kSIM_TMRA3Input_XB_OUT37        = 1U,          /**< Select TMRA3 Input, XB_OUT37. */
} sim_internal_peri_input_t;
#endif /* SIM_INTERNAL_PERI_INPUT_T_ */

#if !defined(SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_)
#define SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_
typedef enum _sim_software_contrl_register_index
{
    kSIM_SCR0                       = 0U,          /**< SCR0. */
    kSIM_SCR1                       = 1U,          /**< SCR1. */
    kSIM_SCR2                       = 2U,          /**< SCR2. */
    kSIM_SCR3                       = 3U,          /**< SCR3. */
    kSIM_SCR4                       = 4U,          /**< SCR4. */
    kSIM_SCR5                       = 5U,          /**< SCR5. */
    kSIM_SCR6                       = 6U,          /**< SCR6. */
    kSIM_SCR7                       = 7U,          /**< SCR7. */
} sim_software_contrl_register_index_t;
#endif /* SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Peripheral_Access_Layer SIM Peripheral Access Layer
 * @{
 */

/** SIM - Register Layout Typedef */
typedef struct {
  __IO uint16_t CTRL;                              /**< Control Register, offset: 0x0 */
  __I  uint16_t RSTAT;                             /**< Reset Status Register, offset: 0x1 */
       uint16_t RESERVED_0[4];
       uint16_t MSHID;                             /**< Most Significant Half of JTAG ID, offset: 0x6 */
       uint16_t LSHID;                             /**< Least Significant Half of JTAG ID, offset: 0x7 */
  __IO uint16_t PWR;                               /**< Power Control Register, offset: 0x8 */
       uint16_t RESERVED_1[1];
  __IO uint16_t CLKOUT;                            /**< Clock Output Select Register, offset: 0xA */
  __IO uint16_t PCR;                               /**< Peripheral Clock Rate Register, offset: 0xB */
  __IO uint16_t PCE0;                              /**< Peripheral Clock Enable Register 0, offset: 0xC */
  __IO uint16_t PCE1;                              /**< Peripheral Clock Enable Register 1, offset: 0xD */
  __IO uint16_t PCE2;                              /**< Peripheral Clock Enable Register 2, offset: 0xE */
  __IO uint16_t PCE3;                              /**< Peripheral Clock Enable Register 3, offset: 0xF */
  __IO uint16_t SD0;                               /**< STOP Disable Register 0, offset: 0x10 */
  __IO uint16_t SD1;                               /**< Peripheral Clock STOP Disable Register 1, offset: 0x11 */
  __IO uint16_t SD2;                               /**< Peripheral Clock STOP Disable Register 2, offset: 0x12 */
  __IO uint16_t SD3;                               /**< Peripheral Clock STOP Disable Register 3, offset: 0x13 */
  __IO uint16_t IOSAHI;                            /**< I/O Short Address Location Register, offset: 0x14 */
  __IO uint16_t IOSALO;                            /**< I/O Short Address Location Register, offset: 0x15 */
  __IO uint16_t PROT;                              /**< Protection Register, offset: 0x16 */
  __IO uint16_t GPSAL;                             /**< GPIOA LSBs Peripheral Select Register, offset: 0x17 */
  __IO uint16_t GPSBL;                             /**< GPIOB LSBs Peripheral Select Register, offset: 0x18 */
  __IO uint16_t GPSCL;                             /**< GPIOC LSBs Peripheral Select Register, offset: 0x19 */
  __IO uint16_t GPSCH;                             /**< GPIOC MSBs Peripheral Select Register, offset: 0x1A */
       uint16_t RESERVED_2[1];
  __IO uint16_t GPSEL;                             /**< GPIOE LSBs Peripheral Select Register, offset: 0x1C */
       uint16_t RESERVED_3[1];
  __IO uint16_t GPSFL;                             /**< GPIOF LSBs Peripheral Select Register, offset: 0x1E */
  __IO uint16_t GPSFH;                             /**< GPIOF MSBs Peripheral Select Register, offset: 0x1F */
       uint16_t RESERVED_4[2];
  __IO uint16_t IPSN;                              /**< Internal Peripheral Select Register, offset: 0x22 */
  __IO uint16_t MISC0;                             /**< Miscellaneous Register 0, offset: 0x23 */
  __IO uint16_t PSWR0;                             /**< Peripheral Software Reset Register 0, offset: 0x24 */
  __IO uint16_t PSWR1;                             /**< Peripheral Software Reset Register 1, offset: 0x25 */
  __IO uint16_t PSWR2;                             /**< Peripheral Software Reset Register 2, offset: 0x26 */
  __IO uint16_t PSWR3;                             /**< Peripheral Software Reset Register 3, offset: 0x27 */
  __IO uint16_t PWRMODE;                           /**< Power Mode Register, offset: 0x28 */
       uint16_t RESERVED_5[3];
  __I  uint16_t NVMOPT2H;                          /**< Non-Volatile Memory Option Register 2 (High), offset: 0x2C */
  __I  uint16_t NVMOPT2L;                          /**< Non-Volatile Memory Option Register 2 (Low), offset: 0x2D */
       uint16_t RESERVED_6[23];
  __IO uint16_t SCR0;                              /**< Software Control Register, offset: 0x45 */
  __IO uint16_t SCR1;                              /**< Software Control Register 1, offset: 0x46 */
  __IO uint16_t SCR2;                              /**< Software Control Register 2, offset: 0x47 */
  __IO uint16_t SCR3;                              /**< Software Control Register 3, offset: 0x48 */
  __IO uint16_t SCR4;                              /**< Software Control Register 4, offset: 0x49 */
  __IO uint16_t SCR5;                              /**< Software Control Register, offset: 0x4A */
  __IO uint16_t SCR6;                              /**< Software Control Register 5, offset: 0x4B */
  __IO uint16_t SCR7;                              /**< Software Control Register 6, offset: 0x4C */
} SIM_Type;

/* ----------------------------------------------------------------------------
   -- SIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Register_Masks SIM Register Masks
 * @{
 */

