zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_SIM.h
#define SIM_GPSFH_F8_MASK                        (0x3U)
#define SIM_GPSFH_F8_SHIFT                       (0U)
/*! F8 - Configure GPIO F8
 *  0b00..Function = RXD0; Peripheral = SCI0; Direction = IN
 *  0b01..Function =XB_OUT10; Peripheral = XBARA; Direction = IO
 *  0b10..Function = CMPD_O; Peripheral = HSCMPD; Direction = OUT
 *  0b11..Function = PWMA_2x; Peripheral = PWMA; Direction = IO
 */
#define SIM_GPSFH_F8(x)                          (((uint16_t)(((uint16_t)(x)) << SIM_GPSFH_F8_SHIFT)) & SIM_GPSFH_F8_MASK)
/*! @} */

/*! @name IPSN - Internal Peripheral Select Register */
/*! @{ */

#define SIM_IPSN_SCI0_MASK                       (0x1U)
#define SIM_IPSN_SCI0_SHIFT                      (0U)
/*! SCI0 - Select SCI0_RXD source
 *  0b0..Function = GPIOC3 or GPIOC8 or GPIOF8; Peripheral = GPIO; Direction = IN
 *  0b1..Function = XB_OUT38; Peripheral = XBAR; Direction = IN
 */
#define SIM_IPSN_SCI0(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_IPSN_SCI0_SHIFT)) & SIM_IPSN_SCI0_MASK)

#define SIM_IPSN_SCI1_MASK                       (0x2U)
#define SIM_IPSN_SCI1_SHIFT                      (1U)
/*! SCI1 - Select SCI1_RXD Input
 *  0b0..Function = GPIOC12 or GPIOF5; Peripheral = GPIO; Direction = IN
 *  0b1..Function = XB_OUT39; Peripheral = XBARA; Direction = IN
 */
#define SIM_IPSN_SCI1(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_IPSN_SCI1_SHIFT)) & SIM_IPSN_SCI1_MASK)

#define SIM_IPSN_TA0_MASK                        (0x100U)
#define SIM_IPSN_TA0_SHIFT                       (8U)
/*! TA0 - Select TMRA0 Input
 *  0b0..Function = GPIOC3; Peripheral = GPIOC; Direction = IN
 *  0b1..Function = XB_OUT34; Peripheral = XBAR; Direction = IN
 */
#define SIM_IPSN_TA0(x)                          (((uint16_t)(((uint16_t)(x)) << SIM_IPSN_TA0_SHIFT)) & SIM_IPSN_TA0_MASK)

#define SIM_IPSN_TA1_MASK                        (0x200U)
#define SIM_IPSN_TA1_SHIFT                       (9U)
/*! TA1 - Select TMRA1 Input
 *  0b0..Function = GPIOC4; Peripheral = GPIOC; Direction = IN
 *  0b1..Function = XB_OUT35; Peripheral = XBAR; Direction = IN
 */
#define SIM_IPSN_TA1(x)                          (((uint16_t)(((uint16_t)(x)) << SIM_IPSN_TA1_SHIFT)) & SIM_IPSN_TA1_MASK)

#define SIM_IPSN_TA2_MASK                        (0x400U)
#define SIM_IPSN_TA2_SHIFT                       (10U)
/*! TA2 - Select TMRA2 Input
 *  0b0..Function = GPIOC6; Peripheral = GPIOC; Direction = IN
 *  0b1..Function = XB_OUT36; Peripheral = XBAR; Direction = IN
 */
#define SIM_IPSN_TA2(x)                          (((uint16_t)(((uint16_t)(x)) << SIM_IPSN_TA2_SHIFT)) & SIM_IPSN_TA2_MASK)

#define SIM_IPSN_TA3_MASK                        (0x800U)
#define SIM_IPSN_TA3_SHIFT                       (11U)
/*! TA3 - Select TMRA3 Input
 *  0b0..Function = GPIOC13; Peripheral = GPIOC; Direction = IN
 *  0b1..Function = XB_OUT37; Peripheral = XBAR; Direction = IN
 */
#define SIM_IPSN_TA3(x)                          (((uint16_t)(((uint16_t)(x)) << SIM_IPSN_TA3_SHIFT)) & SIM_IPSN_TA3_MASK)
/*! @} */

/*! @name MISC0 - Miscellaneous Register 0 */
/*! @{ */

#define SIM_MISC0_PIT_MSTR_MASK                  (0x1U)
#define SIM_MISC0_PIT_MSTR_SHIFT                 (0U)
/*! PIT_MSTR - Select Master Programmable Interval Timer (PIT)
 *  0b0..PIT0 is master PIT and PIT1 is slave PIT
 *  0b1..PIT1 is master PIT and PIT0 is slave PIT
 */
#define SIM_MISC0_PIT_MSTR(x)                    (((uint16_t)(((uint16_t)(x)) << SIM_MISC0_PIT_MSTR_SHIFT)) & SIM_MISC0_PIT_MSTR_MASK)

#define SIM_MISC0_CLKINSEL_MASK                  (0x2U)
#define SIM_MISC0_CLKINSEL_SHIFT                 (1U)
/*! CLKINSEL - CLKIN Select
 *  0b0..CLKIN0 (GPIOC0 alt1) is selected as CLKIN
 *  0b1..CLKIN1 (GPIOC3 alt3) is selected as CLKIN
 */
#define SIM_MISC0_CLKINSEL(x)                    (((uint16_t)(((uint16_t)(x)) << SIM_MISC0_CLKINSEL_SHIFT)) & SIM_MISC0_CLKINSEL_MASK)

#define SIM_MISC0_FAST_MODE_MASK                 (0x4U)
#define SIM_MISC0_FAST_MODE_SHIFT                (2U)
/*! FAST_MODE
 *  0b0..Normal operating mode
 *  0b1..Device boots in fast mode (core:bus :: 2:1) after software reset.
 */
#define SIM_MISC0_FAST_MODE(x)                   (((uint16_t)(((uint16_t)(x)) << SIM_MISC0_FAST_MODE_SHIFT)) & SIM_MISC0_FAST_MODE_MASK)

#define SIM_MISC0_ADC_SCTRL_MASK                 (0x8U)
#define SIM_MISC0_ADC_SCTRL_SHIFT                (3U)
/*! ADC_SCTRL
 *  0b0..Normal order
 *  0b1..Enable the re-ordering of ADC scan control bits
 */
#define SIM_MISC0_ADC_SCTRL(x)                   (((uint16_t)(((uint16_t)(x)) << SIM_MISC0_ADC_SCTRL_SHIFT)) & SIM_MISC0_ADC_SCTRL_MASK)

#define SIM_MISC0_MODE_STAT_MASK                 (0x100U)
#define SIM_MISC0_MODE_STAT_SHIFT                (8U)
/*! MODE_STAT
 *  0b0..Device in normal operating mode with core. Bus frequency is 1:1
 *  0b1..Device in fast mode
 */
#define SIM_MISC0_MODE_STAT(x)                   (((uint16_t)(((uint16_t)(x)) << SIM_MISC0_MODE_STAT_SHIFT)) & SIM_MISC0_MODE_STAT_MASK)
/*! @} */

/*! @name PSWR0 - Peripheral Software Reset Register 0 */
/*! @{ */

#define SIM_PSWR0_GPIO_MASK                      (0x40U)
#define SIM_PSWR0_GPIO_SHIFT                     (6U)
/*! GPIO - GPIO Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR0_GPIO(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR0_GPIO_SHIFT)) & SIM_PSWR0_GPIO_MASK)

#define SIM_PSWR0_TA_MASK                        (0x8000U)
#define SIM_PSWR0_TA_SHIFT                       (15U)
/*! TA - TMRA Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR0_TA(x)                          (((uint16_t)(((uint16_t)(x)) << SIM_PSWR0_TA_SHIFT)) & SIM_PSWR0_TA_MASK)
/*! @} */

/*! @name PSWR1 - Peripheral Software Reset Register 1 */
/*! @{ */

#define SIM_PSWR1_MSCAN_MASK                     (0x1U)
#define SIM_PSWR1_MSCAN_SHIFT                    (0U)
/*! MSCAN - MSCAN Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_MSCAN(x)                       (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_MSCAN_SHIFT)) & SIM_PSWR1_MSCAN_MASK)

#define SIM_PSWR1_IIC0_MASK                      (0x40U)
#define SIM_PSWR1_IIC0_SHIFT                     (6U)
/*! IIC0 - IIC0 Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_IIC0(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_IIC0_SHIFT)) & SIM_PSWR1_IIC0_MASK)

#define SIM_PSWR1_QSPI1_MASK                     (0x100U)
#define SIM_PSWR1_QSPI1_SHIFT                    (8U)
/*! QSPI1 - QSPI1 Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_QSPI1(x)                       (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_QSPI1_SHIFT)) & SIM_PSWR1_QSPI1_MASK)

#define SIM_PSWR1_QSPI0_MASK                     (0x200U)
#define SIM_PSWR1_QSPI0_SHIFT                    (9U)
/*! QSPI0 - QSPI0 Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_QSPI0(x)                       (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_QSPI0_SHIFT)) & SIM_PSWR1_QSPI0_MASK)

#define SIM_PSWR1_SCI1_MASK                      (0x800U)
#define SIM_PSWR1_SCI1_SHIFT                     (11U)
/*! SCI1 - SCI1 Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_SCI1(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_SCI1_SHIFT)) & SIM_PSWR1_SCI1_MASK)

